ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/tst/ad5940_eda/app_files/EDA_App_Test.c
/**
****************************************************************************
* @file     EDA_App_Test.c
* @author   ADI
* @version  V0.1
* @date     04-Dec-2019
* @brief    This source file is used as a test application for eda
****************************************************************************
* @attention
******************************************************************************
* Copyright (c) 2021 Analog Devices, Inc.  All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
* - Redistributions of source code must retain the above copyright notice, this
*   list of conditions and the following disclaimer.
* - Redistributions in binary form must reproduce the above copyright notice,
*   this list of conditions and the following disclaimer in the documentation
*   and/or other materials provided with the distribution.
* - Modified versions of the software must be conspicuously marked as such.
* - This software is licensed solely and exclusively for use with
*   processors/products manufactured by or for Analog Devices, Inc.
* - This software may not be combined or merged with other code in any manner
*   that would cause the software to become subject to terms and conditions
*   which differ from those listed here.
* - Neither the name of Analog Devices, Inc. nor the names of its contributors
*   may be used to endorse or promote products derived from this software
*   without specific prior written permission.
* - The use of this software may or may not infringe the patent rights of one
*   or more patent holders.  This license does not release you from the
*   requirement that you obtain separate licenses from these patent holders to
*   use this software.
*
* THIS SOFTWARE IS PROVIDED BY ANALOG DEVICES, INC. AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
* NONINFRINGEMENT, TITLE, MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL ANALOG DEVICES, INC. OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, PUNITIVE OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, DAMAGES ARISING OUT OF
* CLAIMS OF INTELLECTUAL PROPERTY RIGHTS INFRINGEMENT; PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
******************************************************************************/
#include "EDA_App_Test.h"

#include "sdk_config.h"
#include "nrf_log_ctrl.h"
#include "nrf_delay.h"
#define NRF_LOG_MODULE_NAME EDA_App_Task

#if EDA_APP_CONFIG_LOG_ENABLED
#ifdef NRF_LOG_DEFAULT_LEVEL
#undef NRF_LOG_DEFAULT_LEVEL
#define NRF_LOG_DEFAULT_LEVEL EDA_APP_CONFIG_LOG_LEVEL
#endif      
#define NRF_LOG_INFO_COLOR  EDA_APP_CONFIG_INFO_COLOR
#define NRF_LOG_DEBUG_COLOR  EDA_APP_CONFIG_DEBUG_COLOR
#else //LFS_CONFIG_LOG_ENABLED
#define NRF_LOG_LEVEL       0
#endif //LFS_CONFIG_LOG_ENABLED

#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();

uint32_t ResistorForBaseline = 0;

/** @addtogroup AD5940_System_Examples
 * @{
 *    @defgroup EDA_Example
 *    @brief This example is used to measure skin impedance. The main feature of this example is ultra low power consumption.
 *    @details
 * @note Need to update code when runs at S2 silicon.
 * 
 * 
 * 
 * @{
 * */
AppEDACfg_Type AppEDACfg;
void InitCfg()
{
    memset(&AppEDACfg,0,sizeof(AppEDACfg));

/* Common configurations for all kinds of Application. */
  AppEDACfg.bParaChanged = bTRUE;
  AppEDACfg.SeqStartAddr = 0;
  AppEDACfg.MaxSeqLen = 0;
  AppEDACfg.SeqStartAddrCal = 0;
  AppEDACfg.MaxSeqLenCal = 0;

/* Application related parameters */ 
  AppEDACfg.bBioElecBoard = bTRUE;
  AppEDACfg.ReDoRtiaCal = bFALSE;
  AppEDACfg.SysClkFreq = 16000000.0;
  AppEDACfg.LfoscClkFreq = 32000.0;
  AppEDACfg.AdcClkFreq = 16000000.0;
  AppEDACfg.FifoThresh = 4;
  AppEDACfg.EDAODR = 4.0; /* 20.0 Hz*/
  AppEDACfg.NumOfData = -1;
  AppEDACfg.VoltCalPoints = 8;
  AppEDACfg.RcalVal = 10000.0; /* 10kOhm */
  AppEDACfg.SinFreq = 100.0; /* 100Hz */
  AppEDACfg.SampleFreq = 400.0;    /* 400Hz */
  AppEDACfg.SinAmplitude = 1100.0f/2; /* 1100mV peak */
  AppEDACfg.DacUpdateRate = 7;
  AppEDACfg.LptiaRtiaSel = LPTIARTIA_10K;
  //.LptiaRtiaSel = LPTIARTIA_100K,
  AppEDACfg.DftNum = DFTNUM_16;
  AppEDACfg.HanWinEn = bTRUE;

  AppEDACfg.RtiaAutoScaleEnable = bFALSE;
  //.RtiaAutoScaleEnable = bTRUE,
  AppEDACfg.RtiaAutoScaleMax = LPTIARTIA_512K;
  AppEDACfg.RtiaAutoScaleMin = LPTIARTIA_1K;

  AppEDACfg.RtiaIndexCurr = 0;
  AppEDACfg.RtiaIndexNext = 0;
  AppEDACfg.bChangeRtia = bFALSE;

  /* private varaibles */
  AppEDACfg.SeqPatchInfo.BuffLen = 32;
  AppEDACfg.SeqPatchInfo.pSeqCmd = NULL;

  AppEDACfg.ImpEDABase.Real = 0;
  AppEDACfg.ImpEDABase.Image = 0;
 
  AppEDACfg.ImpSum.Real = 0;
  AppEDACfg.ImpSum.Real = 0;
  AppEDACfg.EDAInited = bFALSE;
  AppEDACfg.StopRequired = bFALSE;
  AppEDACfg.bMeasVoltReq = bFALSE;
  AppEDACfg.EDAStateCurr = EDASTATE_INIT;
  AppEDACfg.EDAStateNext = EDASTATE_INIT;
};

/**
 * @brief This function is provided for upper controllers that want to change
 *        application parameters specially for user defined parameters.
 * @param pCfg: The pointer used to store application configuration structure pointer.
 * @return none.
*/
AD5940Err AppEDAGetCfg(void *pCfg)
{
  if(pCfg){
    *(AppEDACfg_Type**)pCfg = &AppEDACfg;
    return AD5940ERR_OK;
  }
  return AD5940ERR_PARA;
}

/**
 * @brief Control application like start, stop.
 * @param Command: The command for this applicaiton, select from below paramters
 *        - APPCTRL_START: start the measurment. Note: the ramp test need firslty call function AppRAMPInit() every time before start it.
 *        - APPCTRL_STOPNOW: Stop the measurment immediately.
 *        - APPCTRL_STOPSYNC: Stop the measuremnt when current measured data is read back.
 *        - APPCTRL_SHUTDOWN: Stop the measurment immediately and put AFE to shut down mode(turn off LP loop and enter hibernate).
 *        - EDACTRL_MEASVOLT: Measure voltage once current measurment is done(Interrupt occured).
 *        - EDACTRL_GETRTIAMAG: Get current RTIA value.
 * @return none.
*/
AD5940Err AppEDACtrl(int32_t EDACtrl, void *pPara)
{
  switch (EDACtrl)
  {
    case APPCTRL_START:
    {
      WUPTCfg_Type wupt_cfg;

      if(AD5940_WakeUp(10) > 10)  /* Wakeup AFE by read register, read 10 times at most */
        return AD5940ERR_WAKEUP;  /* Wakeup Failed */
      if(AppEDACfg.EDAInited == bFALSE)
        return AD5940ERR_APPERROR;
      /* Start it */
      wupt_cfg.WuptEn = bTRUE;
      wupt_cfg.WuptEndSeq = WUPTENDSEQ_A;
      wupt_cfg.WuptOrder[0] = SEQID_0;
      wupt_cfg.SeqxSleepTime[SEQID_0] = (uint32_t)(AppEDACfg.LfoscClkFreq/AppEDACfg.EDAODR)-2-4;
      wupt_cfg.SeqxWakeupTime[SEQID_0] = 4; /* The minimum value is 1. Do not set it to zero. Set it to 1 will spend 2 32kHz clock. */
      AD5940_WUPTCfg(&wupt_cfg);
      AppEDACfg.FifoDataCount = 0;  /* restart */
      break;
    }
    case APPCTRL_STOPNOW:
    {
      if(AD5940_WakeUp(10) > 10)  /* Wakeup AFE by read register, read 10 times at most */
        return AD5940ERR_WAKEUP;  /* Wakeup Failed */
      /* Start Wupt right now */
      AD5940_WUPTCtrl(bFALSE);
      AD5940_WUPTCtrl(bFALSE);
      break;
    }
    case APPCTRL_STOPSYNC:
    {
      AppEDACfg.StopRequired = bTRUE;
      break;
    }
    case APPCTRL_SHUTDOWN:
    {
      AppEDACtrl(APPCTRL_STOPNOW, 0);  /* Stop the measurement if it's running. */
      /* Turn off LPLoop related blocks which are not controlled automatically by hibernate operation */
      AFERefCfg_Type aferef_cfg;
      LPLoopCfg_Type lp_loop;
      memset(&aferef_cfg, 0, sizeof(aferef_cfg));
      AD5940_REFCfgS(&aferef_cfg);
      memset(&lp_loop, 0, sizeof(lp_loop));
      AD5940_LPLoopCfgS(&lp_loop);
      AD5940_EnterSleepS();  /* Enter Hibernate */
    }
    break;
    case EDACTRL_MEASVOLT:
      AppEDACfg.bMeasVoltReq = bTRUE;
    break;
    case EDACTRL_GETRTIAMAG:
      if(pPara == NULL)
        return AD5940ERR_NULLP; /* Null pointer */
      *(float*)pPara = AD5940_ComplexMag(&AppEDACfg.RtiaCurrValue);
    break;
    case EDACTRL_RSTBASE:
      AppEDACfg.ImpEDABase.Real = 0;
      AppEDACfg.ImpEDABase.Image = 0;
      AppEDACfg.ImpSum.Real = 0;
      AppEDACfg.ImpSum.Image = 0;
      AppEDACfg.ImpSumCount = 0;
    break;
    case EDACTRL_SETBASE:
    {
      fImpCar_Type *pImpBase = (fImpCar_Type *)pPara; /* The impedance used to set base line */
      AppEDACfg.ImpEDABase = *pImpBase;
    }
    break;
    case EDACTRL_GETAVR:
    if(pPara == NULL) return AD5940ERR_NULLP;
    {
      fImpCar_Type *pImpAVR = (fImpCar_Type *)pPara;
      pImpAVR->Real = AppEDACfg.ImpSum.Real/AppEDACfg.ImpSumCount;
      pImpAVR->Image = AppEDACfg.ImpSum.Image/AppEDACfg.ImpSumCount;
    }
    default:
    break;
  }
  return AD5940ERR_OK;
}

/**
 * @brief Generate initialization sequence and write the commands to SRAM.
 * @return return error code.
*/
static AD5940Err AppEDASeqCfgGen(void)
{
  AD5940Err error = AD5940ERR_OK;
  const uint32_t *pSeqCmd;
  uint32_t SeqLen;

