ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/tst/ad5940_eda/app_files/EDA_App_Test.c
  AFERefCfg_Type aferef_cfg;
  HSDACCfg_Type hsdac_cfg; /* Waveform Generator uses some parameter(DAC update rate) from HSDAC config registers */
  LPLoopCfg_Type lp_loop;
  WGCfg_Type wg_cfg;
  DSPCfg_Type dsp_cfg;
  SWMatrixCfg_Type sw_cfg;
  
  AD5940_SEQGenCtrl(bTRUE);
  /* Sequence starts here */
  AD5940_SEQGpioCtrlS(AGPIO_Pin6/*|AGPIO_Pin5*/|AGPIO_Pin1);
  AD5940_StructInit(&aferef_cfg, sizeof(aferef_cfg));
  AD5940_REFCfgS(&aferef_cfg);  /* Turn off all references, we only enable it when we need it. */
  
  AD5940_StructInit(&lp_loop, sizeof(lp_loop)); /* Disable everything, configure them during measurment */
  AD5940_LPLoopCfgS(&lp_loop);

  AD5940_StructInit(&wg_cfg, sizeof(wg_cfg));
  wg_cfg.SinCfg.SinAmplitudeWord = (uint32_t)(AppEDACfg.SinAmplitude/1100.0f*2047); /* Maximum amplitude is 1100mV */
  wg_cfg.SinCfg.SinFreqWord = AD5940_WGFreqWordCal(AppEDACfg.SinFreq, AppEDACfg.LfoscClkFreq);
  wg_cfg.SinCfg.SinPhaseWord = 0;
  wg_cfg.WgType = WGTYPE_SIN;
  AD5940_WGCfgS(&wg_cfg);
  AD5940_AFECtrlS(AFECTRL_ALL, bFALSE);

  /* Switch configuration for BioElec board */
  sw_cfg.Dswitch = SWD_OPEN;  /* Open all switch D */
  //sw_cfg.Dswitch = SWD_CE0; 
  sw_cfg.Pswitch = SWP_AIN2|SWP_SE0;
  sw_cfg.Nswitch = SWN_OPEN;
  sw_cfg.Tswitch = SWT_AIN0|SWT_AFE3LOAD;
  AD5940_SWMatrixCfgS(&sw_cfg);

  AD5940_StructInit(&dsp_cfg, sizeof(dsp_cfg));
  dsp_cfg.ADCBaseCfg.ADCMuxN = ADCMUXN_VSET1P1;
  dsp_cfg.ADCBaseCfg.ADCMuxP = ADCMUXP_AIN4;//commented
  //dsp_cfg.ADCBaseCfg.ADCMuxN = ADCMUXN_AIN2;
  //dsp_cfg.ADCBaseCfg.ADCMuxP = ADCMUXP_VCE0;

  dsp_cfg.ADCBaseCfg.ADCPga = ADCPGA_1;
  dsp_cfg.ADCFilterCfg.ADCRate = ADCRATE_800KHZ;
  dsp_cfg.ADCFilterCfg.ADCAvgNum = ADCAVGNUM_4; /* We use averaged SINC3 output as DFT input source */
  dsp_cfg.ADCFilterCfg.ADCSinc2Osr = ADCSINC2OSR_22;  /* Don't care */
  dsp_cfg.ADCFilterCfg.ADCSinc3Osr = ADCSINC3OSR_5;
  dsp_cfg.ADCFilterCfg.BpNotch = bTRUE;
  dsp_cfg.ADCFilterCfg.BpSinc3 = bFALSE;
  dsp_cfg.ADCFilterCfg.DFTClkEnable = bTRUE;
  dsp_cfg.ADCFilterCfg.Sinc2NotchClkEnable = bFALSE;  /* disable SINC2 since we don't need it. */
  dsp_cfg.ADCFilterCfg.Sinc2NotchEnable = bFALSE;
  dsp_cfg.ADCFilterCfg.Sinc3ClkEnable = bTRUE;
  dsp_cfg.ADCFilterCfg.WGClkEnable = bTRUE;
  dsp_cfg.DftCfg.DftNum = AppEDACfg.DftNum;
  dsp_cfg.DftCfg.DftSrc = DFTSRC_AVG; /* Use averaged SINC3 data */
  dsp_cfg.DftCfg.HanWinEn = AppEDACfg.HanWinEn;
  AD5940_DSPCfgS(&dsp_cfg);
  AD5940_ADCRepeatCfgS(5*(4+2)+1);  /* (n+2)*osr + 1, n=4,osr=5*/
  hsdac_cfg.ExcitBufGain = EXCITBUFGAIN_2;
  hsdac_cfg.HsDacGain = HSDACGAIN_1;
  hsdac_cfg.HsDacUpdateRate = AppEDACfg.DacUpdateRate;  /* Note: the DAC update rate is decided by register DACON.RATE */
  AD5940_HSDacCfgS(&hsdac_cfg);

  AD5940_SEQGpioCtrlS(0/*AGPIO_Pin6|AGPIO_Pin5|AGPIO_Pin1*/);        //GP6->endSeq, GP5 -> AD8233=OFF, GP1->RLD=OFF .

  /* Sequence end. */
  AD5940_SEQGenInsert(SEQ_STOP()); /* Add one extra command to disable sequencer for initialization sequence because we only want it to run one time. */
  /* Stop here */
  AD5940_SEQGenCtrl(bFALSE); /* Stop sequencer generator */
  error = AD5940_SEQGenFetchSeq(&pSeqCmd, &SeqLen);
  if(error == AD5940ERR_OK)
  {
    AppEDACfg.InitSeqInfo.SeqId = SEQID_1;
    AppEDACfg.InitSeqInfo.SeqRamAddr = AppEDACfg.SeqStartAddr;
    AppEDACfg.InitSeqInfo.pSeqCmd = pSeqCmd;
    AppEDACfg.InitSeqInfo.SeqLen = SeqLen;
    AppEDACfg.InitSeqInfo.WriteSRAM = bTRUE;
    AD5940_SEQInfoCfg(&AppEDACfg.InitSeqInfo); /* Write command to SRAM */
  }
  else
    return error; /* Error */
  return AD5940ERR_OK;
}

/**
 * @brief Generate patch sequence according to current measurement type(Voltage or Current). 
 * @details The patch is used to adjust sequencer commands already stored in SRAM of AD5940 in order to perform different measurments. 
 *          The reason is that the sequences need to be adjusted. Using the patch method will make things easiy and we won't need to modify 
 *          sequences in register level.
 * @param pPatch: pointer to patch information include the measurement type, Rtia selection and buffers.
 * @return return error code.
*/
static AD5940Err ApPEDASeqPatchGen(SeqPatchInfo_Type *pPatch)
{
  AD5940Err err;
  const uint32_t *pSeqCmd;
  uint32_t SeqLen;
  LPAmpCfg_Type lpamp_cfg;
  AD5940_SEQGenInit(pPatch->Buffer, pPatch->BuffLen);
  AD5940_SEQGenCtrl(bTRUE);
  lpamp_cfg.LpAmpSel = LPAMP0;
  lpamp_cfg.LpAmpPwrMod = LPAMPPWR_NORM;       /* Use normal power mode is enough */
  lpamp_cfg.LpPaPwrEn = bTRUE;                 /* Enable Potential amplifier */
  lpamp_cfg.LpTiaPwrEn = bTRUE;                /* Enable TIA amplifier */
  lpamp_cfg.LpTiaRf = LPF_RF;                  /* Rf resistor controls cut off frequency. */
  lpamp_cfg.LpTiaRload = LPTIARLOAD_100R;      /** @note Use 100Ohm Rload. */
  lpamp_cfg.LpTiaRtia = pPatch->RtiaSel;  /* If autoscaling is enabled, use seleted value. */
  if(pPatch->Type == PATCHTYPE_VOLT)
    lpamp_cfg.LpTiaSW = LPTIASW_VOLT;            /* Swtich settings for voltage measurement */
  else if(pPatch->Type == PATCHTYPE_CURR)
    lpamp_cfg.LpTiaSW = LPTIASW_CURR;            /* Swtich settings for current measurement */
  AD5940_LPAMPCfgS(&lpamp_cfg);
  AD5940_SEQGenCtrl(bFALSE);
  err = AD5940_SEQGenFetchSeq(&pSeqCmd, &SeqLen);
  if(err != AD5940ERR_OK)
    return err;
  pPatch->pSeqCmd = pSeqCmd;
  pPatch->SeqLen = SeqLen;
  return AD5940ERR_OK;
}

/**
 * @brief Generate measurement sequence and write the commands to SRAM.
 * @return return error code.
*/
static AD5940Err AppEDASeqMeasureGen(void)
{
  AD5940Err error = AD5940ERR_OK;
  const uint32_t *pSeqCmd;
  uint32_t SeqLen;
  uint32_t i;
  uint32_t DFTNumber; 

  LPDACCfg_Type lpdac_cfg;
  LPAmpCfg_Type lpamp_cfg;
  /* Start sequence generator here */
  AD5940_SEQGenCtrl(bTRUE);
  
  /* Stage I: Initialization */
  AD5940_SEQGpioCtrlS(AGPIO_Pin6/*|AGPIO_Pin5|AGPIO_Pin1*/);//GP6->endSeq, GP5 -> AD8233=OFF, GP1->RLD=OFF .
  /* LP loop configure: LPDAC and LPAMP */
  lpdac_cfg.LpdacSel = LPDAC0;
  lpdac_cfg.DataRst = bFALSE;
  lpdac_cfg.LpDacSW = LPDACSW_VBIAS2LPPA/*|LPDACSW_VBIAS2PIN*/|LPDACSW_VZERO2LPTIA|LPDACSW_VZERO2PIN;
  lpdac_cfg.LpDacRef = LPDACREF_2P5;           /* Use internal 2.5V reference */
  lpdac_cfg.LpDacSrc = LPDACSRC_WG;            /* Use data from waveform generator */
  lpdac_cfg.LpDacVbiasMux = LPDACVBIAS_12BIT;
  lpdac_cfg.LpDacVzeroMux = LPDACVZERO_6BIT;   /* Use 6bit LPDAC for Vzero */
  lpdac_cfg.PowerEn = bTRUE;                   /* Enable LPDAC */
  lpdac_cfg.DacData12Bit = 0;                  /* Don't care, 12bit DAC data is from WG */
  lpdac_cfg.DacData6Bit = 32;                  /* Set it to middle scale of LPDAC. Vzero is the bias voltage of LPTIA amplifire */ 
  AD5940_LPDACCfgS(&lpdac_cfg);

  /* Voltage and current measurment need different switch settings, record the difference and only modify this part for different purpose */
  error = AD5940_SEQGenFetchSeq(NULL, &AppEDACfg.SeqPatchInfo.SRAMAddr); /* Record the start address of below commands */
  if(error != AD5940ERR_OK)
    return error;
  
  lpamp_cfg.LpAmpSel = LPAMP0;
  lpamp_cfg.LpAmpPwrMod = LPAMPPWR_NORM;       /* Use normal power mode is enough */
  lpamp_cfg.LpPaPwrEn = bTRUE;                 /* Enable Potential amplifier */
  lpamp_cfg.LpTiaPwrEn = bTRUE;                /* Enable TIA amplifier */
  lpamp_cfg.LpTiaRf = LPF_RF;                  /* Rf resistor controls cut off frequency. */
  lpamp_cfg.LpTiaRload = LPTIARLOAD_100R;      /** @note Use 100Ohm Rload. */
  lpamp_cfg.LpTiaRtia = AppEDACfg.LptiaRtiaSel;  /* If autoscaling is enabled, use seleted value. */
  lpamp_cfg.LpTiaSW = LPTIASW_VOLT;            /* Swtich settings for voltage measurement */
  AD5940_LPAMPCfgS(&lpamp_cfg);

  AD5940_WriteReg(REG_AFE_LPREFBUFCON, 0);    /* Enable low power bandgap and 2.5V reference buffer  */  
  AD5940_AFECtrlS(AFECTRL_ALL, bFALSE);     /* Off everything */

  AD5940_LPModeEnS(bTRUE);  /* Enter LP control mode. The registers are summarized to LPMODECON, so we can control some blocks convenniently */
  AD5940_LPModeClkS(LPMODECLK_LFOSC); /* Trigger switching system clock to 32kHz */
  AD5940_LPModeCtrlS(LPMODECTRL_NONE);    /* Disable all */
  AD5940_AFECtrlS(AFECTRL_WG, bTRUE);     /* Start waveform generator */
  AD5940_SEQGenInsert(SEQ_WAIT(LPF_TIME*32));   /* wait for stable */
  AD5940_AFECtrlS(AFECTRL_DFT, bTRUE);     /* Enable DFT engine */

  /* Stage II: ADC Run to sample enough data(DFT number) */
  DFTNumber = (1<<(AppEDACfg.DftNum +2));
  for(i=0;i<DFTNumber;i++)
  {
    #define EDA_LPMODCTRLSETS LPMODECTRL_GLBBIASZ|LPMODECTRL_GLBBIASP|LPMODECTRL_HPREFPWR|LPMODECTRL_BUFHP1P8V|LPMODECTRL_BUFHP1P1V|LPMODECTRL_HFOSCEN

    AD5940_LPModeCtrlS(EDA_LPMODCTRLSETS);                        /* Turn ON HPREF. */
    AD5940_SEQGenInsert(SEQ_WAIT(4));
    AD5940_LPModeCtrlS(EDA_LPMODCTRLSETS|LPMODECTRL_REPEATEN);    /* Set RepeatEN will enable ADC power */
    AD5940_SEQGenInsert(SEQ_NOP());   /* Wait 50us at least to allow ADC settiling. one NOP commands consumes two system clock(32kHz) before ADCCNV = 61.5us. */
    AD5940_LPModeCtrlS(EDA_LPMODCTRLSETS|LPMODECTRL_ADCCNV);   /* Start ADC conversion. !!Clear REPEATEN bit */
    AD5940_SEQGenInsert(SEQ_NOP());
    /* One command need 31.25us because the system clock is 32kHz now. */
    if(i != DFTNumber-1)   /* There is no need to wait such long time for last point, only enough clock for DFT calculation before disable it. */
    {
      AD5940_LPModeCtrlS(LPMODECTRL_NONE);      /* Disable all */
      AD5940_SEQGenInsert(SEQ_WAIT(AppEDACfg.LfoscClkFreq/AppEDACfg.SampleFreq - 12));
    }
    else
    {
      AD5940_LPModeCtrlS(LPMODECTRL_HFOSCEN);   /* Disable all except 16MHz HFOSC */
      AD5940_SEQGenInsert(SEQ_WAIT(21));      /* wait another 21 clocks. DFT need it to calculte last input data */
    }
  }
  /* Stage III: Turn off all we can */
  AD5940_LPModeClkS(LPMODECLK_HFOSC);     /* Switching back to 16MHz */
  AD5940_AFECtrlS(AFECTRL_ALL, bFALSE);   /* Disable waveform generator */

  lpamp_cfg.LpAmpSel = LPAMP0;
  lpamp_cfg.LpPaPwrEn = bFALSE;
  lpamp_cfg.LpTiaPwrEn = bFALSE;
  lpamp_cfg.LpTiaRf = LPTIARF_OPEN;
  lpamp_cfg.LpTiaRtia = LPTIARTIA_OPEN;
  lpamp_cfg.LpTiaSW = 0;  
  AD5940_LPAMPCfgS(&lpamp_cfg);
  AD5940_WriteReg(REG_AFE_LPREFBUFCON, BITM_AFE_LPREFBUFCON_LPBUF2P5DIS|BITM_AFE_LPREFBUFCON_LPREFDIS);
  lpdac_cfg.LpDacSW = 0;    /* Disconnect all switch */
  lpdac_cfg.PowerEn = bFALSE;
  AD5940_LPDACCfgS(&lpdac_cfg);
  AD5940_SEQGpioCtrlS(0/*AGPIO_Pin6|AGPIO_Pin5|AGPIO_Pin1*/);        //GP6->endSeq, GP5 -> AD8233=OFF, GP1->RLD=OFF .
  AD5940_EnterSleepS();/* Go to hibernate */

  /* Sequence end. */
  AD5940_SEQGenCtrl(bFALSE); /* Stop sequencer generator */
  error = AD5940_SEQGenFetchSeq(&pSeqCmd, &SeqLen);
  if(error == AD5940ERR_OK)
  {
    if(AppEDACfg.MaxSeqLen < (SeqLen + AppEDACfg.InitSeqInfo.SeqLen))
      return AD5940ERR_BUFF;    /* Buffer limited */
    AppEDACfg.MeasureSeqInfo.SeqId = SEQID_0;
    AppEDACfg.MeasureSeqInfo.SeqRamAddr = AppEDACfg.InitSeqInfo.SeqRamAddr + AppEDACfg.InitSeqInfo.SeqLen ;
    AppEDACfg.MeasureSeqInfo.pSeqCmd = pSeqCmd;
    AppEDACfg.MeasureSeqInfo.SeqLen = SeqLen;
    AppEDACfg.MeasureSeqInfo.WriteSRAM = bTRUE;
    AD5940_SEQInfoCfg(&AppEDACfg.MeasureSeqInfo); /* Write command to SRAM */
    /* Record where the patch should be applied. */
    AppEDACfg.SeqPatchInfo.SRAMAddr += AppEDACfg.MeasureSeqInfo.SeqRamAddr;  /* The start address in AD5940 SRAM */
  }
  else
    return error; /* Error */
  return AD5940ERR_OK;
}


  fImpCar_Type RtiaCalValue;  /* Calibration result */ // imaginary and real
/**
 * @brief Calibrate LPTIA internal RTIA resistor(s).
 * @details This function will do calibration using parameters stored in @ref AppEDACfg structure.
 * @return return error code.
*/
AD5940Err AppEDARtiaCal(void)
{

  LPRTIACal_Type lprtia_cal;
  AD5940_StructInit(&lprtia_cal, sizeof(lprtia_cal));

  lprtia_cal.LpAmpSel = LPAMP0; // low power amplifier (LPTIA + potentiostat amplifier)
  lprtia_cal.bPolarResult = bFALSE;                /* Real + Image */
  lprtia_cal.AdcClkFreq = AppEDACfg.AdcClkFreq;
  lprtia_cal.SysClkFreq = AppEDACfg.SysClkFreq;
  lprtia_cal.ADCSinc3Osr = ADCSINC3OSR_4;
  lprtia_cal.ADCSinc2Osr = ADCSINC2OSR_22;        /* We don't use SINC2 for now. */
  lprtia_cal.DftCfg.DftNum = DFTNUM_2048;        /* Maximum DFT number */
  lprtia_cal.DftCfg.DftSrc = DFTSRC_SINC2NOTCH;
  lprtia_cal.DftCfg.HanWinEn = bTRUE;
  lprtia_cal.fFreq = AppEDACfg.SinFreq;
  lprtia_cal.fRcal = AppEDACfg.RcalVal;
  lprtia_cal.bWithCtia = bTRUE;
  lprtia_cal.LpAmpPwrMod = LPAMPPWR_NORM;
  lprtia_cal.bWithCtia = bTRUE;
  lprtia_cal.LpTiaRtia = AppEDACfg.LptiaRtiaSel;
  //NRF_LOG_DEBUG("Auto scale parameter = %d\n", AppEDACfg.RtiaAutoScaleEnable );
  
  // if autoscale enable
  if(AppEDACfg.RtiaAutoScaleEnable == bTRUE)
  {
    int i = AppEDACfg.RtiaAutoScaleMin;
    for(;i<=AppEDACfg.RtiaAutoScaleMax; i++)
    {
      lprtia_cal.LpTiaRtia = i;
      AD5940_LPRtiaCal(&lprtia_cal, &RtiaCalValue);
      AppEDACfg.RtiaCalTable[i] = RtiaCalValue;
      //NRF_LOG_DEBUG("Rtia%d,%f,%f\n", i, RtiaCalValue.Real, RtiaCalValue.Image);
    }
    AppEDACfg.RtiaCurrValue = AppEDACfg.RtiaCalTable[AppEDACfg.RtiaIndexCurr];
  }
  else
  {  
    AD5940_LPRtiaCal(&lprtia_cal, &RtiaCalValue);
    AppEDACfg.RtiaCurrValue = RtiaCalValue;
    //NRF_LOG_DEBUG("Rtia,%f,%f\n", RtiaCalValue.Real, RtiaCalValue.Image);
    //NRF_LOG_DEBUG("Rtia calibration done\n");
  }
  return AD5940ERR_OK;
}

/**
 * @brief Initialize the EDA measurement.
 * @details This function must be called before start measurement. It will initialize all needed hardwares and put AD5940 to ready state.
 *          The application parameters stored in @ref AppEDACfg can be changed. Call this function to re-initialize AD5940 with new parameters.
 * @param pBuffer: the buffer for sequencer generator. Only need to provide it for the first time.
 * @param BufferSize: The buffer size start from pBuffer.
 * @return return error code.
*/
AD5940Err AppEDAInit(uint32_t *pBuffer, uint32_t BufferSize)
{
  AD5940Err error = AD5940ERR_OK;
  SEQCfg_Type seq_cfg;// sequencer configuration
  FIFOCfg_Type fifo_cfg;// FIFO configuration

  AppEDACfg.EDAStateCurr = EDASTATE_INIT; // which state is EDA App is in , init/voltage mesaurement / current / RTIA Calibration
  if(AD5940_WakeUp(10) > 10)  /* Wakeup AFE by read register, read 10 times at most */
    return AD5940ERR_WAKEUP;  /* Wakeup Failed */

  #if 1
  // add mux enable for eda measurement            
  // output enable
  uint32_t tempreg;
  tempreg = AD5940_ReadReg(REG_AGPIO_GP0OEN);
  tempreg &= 0xFFE7;
  tempreg |= 0x0018;
  AD5940_AGPIOOen(tempreg);
  
  //pull up / pull down register
  tempreg = AD5940_ReadReg(REG_AGPIO_GP0PE);
  tempreg &= 0xFFE7;
  tempreg |= 0x0018;
  AD5940_AGPIOPen(tempreg);

  //data set register
  tempreg =  AD5940_ReadReg(REG_AGPIO_GP0SET);
  tempreg &= 0xFFE7;
  tempreg |= 0x0008;// set only eda gpio pin as high
  AD5940_AGPIOSet(tempreg);
#endif

