ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/tst/ad5940_eda/app_files/EDA_App_Test.c
  return 0;
}

int gErrCnt = 0;

#define AD5940_ADIID              0x4144      /**< ADIID is fixed to 0x4144 */



/**
 * @brief Register modification function.
 * @details This function is called in ISR when AFE has been wakeup and we can access registers.
 * @param pData: the buffer points to data read back from FIFO. Not needed for this application-RAMP
 * @param pDataCount: The data count in pData buffer.
 * @return return error code.
*/
static AD5940Err AppEDARegModify(int32_t * const pData, uint32_t *pDataCount)
{
  AD5940Err error = AD5940ERR_OK;
  if(AppEDACfg.EDAStateCurr == EDASTATE_VOLT)
  {
    SWMatrixCfg_Type sw_cfg;
    /* Next step is to measure current */
    AppEDACfg.EDAStateNext = EDASTATE_CURR;
    /* Need change some registers in order to measure current */
    AD5940_SEQCtrlS(bFALSE);                  /* Stop it for now. */
    AD5940_FIFOCtrlS(FIFOSRC_DFT, bFALSE);    /* Disable FIFO firstly because we are going to change FIFO threshold */
    AD5940_FIFOThrshSet(AppEDACfg.FifoThresh);
    AD5940_FIFOCtrlS(FIFOSRC_DFT, bTRUE);     /* Enable FIFO. */

    //arpitha code change
    /* Change Switch matrix settings to connect AIN2(body) to SE0 */
    sw_cfg.Dswitch = SWD_OPEN;  /* Open all switch D */
    //sw_cfg.Dswitch = SWD_CE0;  /* Open all switch D */
    sw_cfg.Pswitch = SWP_AIN2|SWP_SE0;
    sw_cfg.Nswitch = SWN_OPEN;
    sw_cfg.Tswitch = SWT_AIN0|SWT_AFE3LOAD;    /* This switch is for ECG. */
    AD5940_SWMatrixCfgS(&sw_cfg);
    /* Apply patch for current measurment */
    //AppEDACfg.SeqPatchInfo.bMeasureVolt = bFALSE;
    AppEDACfg.SeqPatchInfo.Type = PATCHTYPE_CURR;
    AppEDACfg.SeqPatchInfo.RtiaSel = AppEDACfg.RtiaIndexNext;
    error = ApPEDASeqPatchGen(&AppEDACfg.SeqPatchInfo);
    if(error != AD5940ERR_OK)
      return error;
    AD5940_SEQCmdWrite(AppEDACfg.SeqPatchInfo.SRAMAddr, \
                        AppEDACfg.SeqPatchInfo.pSeqCmd, AppEDACfg.SeqPatchInfo.SeqLen); /* Apply the patch to SRAM */

    AD5940_SEQCtrlS(bTRUE);                   /* Enable sequencer. Sequencer will run when next valid trigger comes */
  }
  else if(AppEDACfg.EDAStateCurr == EDASTATE_CURR)
  {
    if(AppEDACfg.bChangeRtia == bTRUE)
    {
      AppEDACfg.bChangeRtia = bFALSE;
      /* Apply patch for next RTIA selection */
      AppEDACfg.SeqPatchInfo.Type = PATCHTYPE_CURR;
      AppEDACfg.SeqPatchInfo.RtiaSel = AppEDACfg.RtiaIndexNext;
      error = ApPEDASeqPatchGen(&AppEDACfg.SeqPatchInfo);
      if(error != AD5940ERR_OK)
        return error;
      AD5940_SEQCmdWrite(AppEDACfg.SeqPatchInfo.SRAMAddr, \
                        AppEDACfg.SeqPatchInfo.pSeqCmd, AppEDACfg.SeqPatchInfo.SeqLen); /* Apply the patch to SRAM */
    }
  }
  
  if(AppEDACfg.bMeasVoltReq == bTRUE)
  {
    SWMatrixCfg_Type sw_cfg;
    AppEDACfg.bMeasVoltReq = bFALSE;    /* Clear this request */
    /* Next step is to measure voltage */
    AppEDACfg.EDAStateNext = EDASTATE_VOLT;

    /* Change Switch matrix settings to connect AIN2(body) to SE0 */
    sw_cfg.Dswitch = SWD_OPEN;  /* Open all switch D */
    sw_cfg.Pswitch = SWP_OPEN;
    sw_cfg.Nswitch = SWN_OPEN;
    sw_cfg.Tswitch = SWT_AIN0|SWT_AFE3LOAD;    /* This switch is for ECG. */
    AD5940_SWMatrixCfgS(&sw_cfg);

    /* Need change some registers in order to measure current */
    AD5940_SEQCtrlS(bFALSE);                  /* Stop it for now. */
    AD5940_FIFOCtrlS(FIFOSRC_DFT, bFALSE);    /* Disable FIFO firstly because we are going to change FIFO threshold */
    AD5940_FIFOThrshSet(AppEDACfg.VoltCalPoints*2);
    AD5940_FIFOCtrlS(FIFOSRC_DFT, bTRUE);     /* Enable FIFO. */

    /* Apply patch for current measurment */
    AppEDACfg.SeqPatchInfo.Type = PATCHTYPE_VOLT;
    AppEDACfg.SeqPatchInfo.RtiaSel = LPTIARTIA_OPEN;//AppEDACfg.RtiaIndexNext;
    error = ApPEDASeqPatchGen(&AppEDACfg.SeqPatchInfo);
    if(error != AD5940ERR_OK)
      return error;
    AD5940_SEQCmdWrite(AppEDACfg.SeqPatchInfo.SRAMAddr, \
                        AppEDACfg.SeqPatchInfo.pSeqCmd, AppEDACfg.SeqPatchInfo.SeqLen); /* Apply the patch to SRAM */

    AD5940_SEQCtrlS(bTRUE);                   /* Enable sequencer. Sequencer will run when next valid trigger comes */
  }

  if(AppEDACfg.NumOfData > 0)
  {
    AppEDACfg.FifoDataCount += *pDataCount/4;
    if(AppEDACfg.FifoDataCount >= AppEDACfg.NumOfData)
    {
      AD5940_WUPTCtrl(bFALSE);
      return AD5940ERR_OK;
    }
  }
  if(AppEDACfg.StopRequired == bTRUE)
  {
    AD5940_WUPTCtrl(bFALSE);
    return AD5940ERR_OK;
  }
  return AD5940ERR_OK;
}

/**
 * @brief Depending on the data type, do appropriate data pre-process before return back to controller
 * @param pImpedance: the buffer points to pre-processed data. We use the impedance magnitude value to decide new RTIA settings.
 * @param uiDataCount: The data count in pData buffer.
 * @return return the next appropriate RTIA index value.
*/
static uint32_t EDARtiaAutoScaling(fImpCar_Type * const pImpedance, uint32_t uiDataCount)
{
  uint32_t OptRtiaIndex;
  float MagMean = 0;
  fImpCar_Type SumImp={0,0};

  /* Get Averaged Magnitude Result */
  for(int i=0;i<uiDataCount;i++)
  {
    SumImp.Real += pImpedance[i].Real;
    SumImp.Image += pImpedance[i].Image;
  }
  SumImp.Real /= uiDataCount;
  SumImp.Image /= uiDataCount;
  SumImp = AD5940_ComplexAddFloat(&SumImp, &AppEDACfg.ImpEDABase); /* Impedance under test is sum of changed value and baseline */
  MagMean = AD5940_ComplexMag(&SumImp);
  OptRtiaIndex = AppEDACfg.RtiaAutoScaleMin;
  /* This is much easier because although the RTIA is not the best value, the results are still reliable. We can directly choose the RTIA matched */
  for(;OptRtiaIndex < AppEDACfg.RtiaAutoScaleMax;)
  {
    float mag;
    mag = AD5940_ComplexMag(&AppEDACfg.RtiaCalTable[OptRtiaIndex+1]);
    if(MagMean < mag*0.97f) /* @todo add threshold?? */
      break;
    OptRtiaIndex ++;
  }
  return OptRtiaIndex;
}


/**
 * @brief Data pre-process
 * @details Depending on the data type, do appropriate data pre-process before return back to controller
 * @param pData: the buffer points to data read back from FIFO. Not needed for this application-RAMP
 * @param pDataCount: The data count in pData buffer.
 * @return return error code.
*/
int32_t SumReal = 0, SumImage = 0;
static AD5940Err AppEDADataProcess(int32_t * const pData, uint32_t *pDataCount)
{
  uint32_t DataCount = *pDataCount;
  
