ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/tst/ad5940_eda/app_files/EDA_App_Test.c
  *pDataCount = 0;

  /* EDA results are DFT results */
  for(uint32_t i=0; i<DataCount; i++)
  {
    pData[i] &= 0x3ffff; /* @todo option to check ECC */
    if(pData[i]&(1<<17)) /* Bit17 is sign bit */
      pData[i] |= 0xfffc0000; /* Data is 18bit in two's complement, bit17 is the sign bit */
    
    //NRF_LOG_DEBUG("Data[%] = %d",i,pData[i]);
  }

  if(AppEDACfg.EDAStateCurr == EDASTATE_VOLT)
  {
    uint32_t DftResCnt;
    iImpCar_Type *pDftRes = (iImpCar_Type*)pData;
	SumReal = 0, SumImage = 0;
    /* Get average excitation voltage */
    if(DataCount != AppEDACfg.VoltCalPoints*2)
      return EDAERR_VOLTMEASURE;
    DftResCnt = DataCount/2;
    if(DftResCnt > 4)
    {
      DftResCnt -= 4;
      pDftRes += 4; /* Discard the first 4 results */
    }
    for(uint32_t i=0;i<DftResCnt;i++)
    {
      SumReal += pDftRes[i].Real;
      SumImage += pDftRes[i].Image;
      //NRF_LOG_DEBUG("Volt, %d, %d\n", pDftRes[i].Real, pDftRes[i].Image);
    }
    SumReal /= (int32_t)DftResCnt;
    SumImage /= (int32_t)DftResCnt; /* Get average result */
    SumImage = -SumImage;           /* Fix sign of imaginary part of DFT result. */

    AppEDACfg.ExcitVolt.Real = SumReal;
    AppEDACfg.ExcitVolt.Image = SumImage;
    //NRF_LOG_DEBUG("Volt:%f,%f\n", AppEDACfg.ExcitVolt.Real, AppEDACfg.ExcitVolt.Image);
    /* Done */
    *pDataCount = 0; /* Don't return voltage result */
  }
  else if(AppEDACfg.EDAStateCurr == EDASTATE_CURR)/* The FIFO data is current result. We need to calculate impedance, Z=V/I */
  {
    iImpCar_Type * const pSrc = (iImpCar_Type*)pData;
    fImpCar_Type * const pOut = (fImpCar_Type*)pData;
    for(uint32_t i=0; i<DataCount/2; i++)
    {
      fImpCar_Type DftCurr;
      fImpCar_Type res;

      DftCurr.Real = (float)pSrc[i].Real;
      DftCurr.Image = (float)pSrc[i].Image;
      DftCurr.Image = -DftCurr.Image;
      DftCurr.Real = -DftCurr.Real;
      DftCurr.Image = -DftCurr.Image;
      res = AD5940_ComplexDivFloat(&DftCurr, &AppEDACfg.RtiaCurrValue);           /* I=Vrtia/Zrtia */
      res = AD5940_ComplexDivFloat(&AppEDACfg.ExcitVolt, &res);
      AppEDACfg.ImpSum = AD5940_ComplexAddFloat(&AppEDACfg.ImpSum ,&res);
      AppEDACfg.ImpSumCount ++;
      res = AD5940_ComplexSubFloat(&res, &AppEDACfg.ImpEDABase);
      pOut[i] = res;
    }
    *pDataCount = DataCount/2; /* Impedance result */

    /* Process RTIA autoscaling calculation */
    if(AppEDACfg.RtiaAutoScaleEnable)
    {
      static uint32_t rtia_pre = (uint32_t)-1; /* Init to invalid value */
      uint32_t rtia_index;

      AppEDACfg.RtiaIndexCurr = AppEDACfg.RtiaIndexNext;
      AppEDACfg.RtiaCurrValue = AppEDACfg.RtiaCalTable[AppEDACfg.RtiaIndexCurr];

      rtia_index = EDARtiaAutoScaling(pOut,*pDataCount);
      if(rtia_index != rtia_pre)
      {
        AppEDACfg.bChangeRtia = bTRUE;
        rtia_pre = rtia_index;
        AppEDACfg.RtiaIndexNext = rtia_index;
      }
    }
  }
  AppEDACfg.EDAStateCurr = AppEDACfg.EDAStateNext;    /* We have to move forward the state at end of data processing */
  return AD5940ERR_OK;
}

/**
 * @brief The interrupt service routine for EDA.
 * @param pBuff: The buffer provides by host, used to store data read back from FIFO.
 * @param pCount: The available buffer size starts from pBuff.
 * @return return error code.
*/
 uint32_t FifoCnt;
AD5940Err AppEDAISR(void *pBuff, uint32_t *pCount)
{
  uint32_t BuffCount;
  BuffCount = *pCount;
  if(AppEDACfg.EDAInited == bFALSE)
    return AD5940ERR_APPERROR;
  if(AD5940_WakeUp(10) > 10)  /* Wakeup AFE by read register, read 10 times at most */
    return AD5940ERR_WAKEUP;  /* Wakeup Failed */
  AD5940_SleepKeyCtrlS(SLPKEY_LOCK);  /* Don't enter hibernate */
  *pCount = 0;

  if(AD5940_INTCTestFlag(AFEINTC_0, AFEINTSRC_DATAFIFOTHRESH) == bTRUE)
  {
    /* Now there should be 4 data in FIFO */
    FifoCnt = (AD5940_FIFOGetCnt()/4)*4;
    
    if(FifoCnt > BuffCount)
    {
      //@todo buffer is limited.
    }
    AD5940_FIFORd((int32_t *)pBuff, FifoCnt);
    AD5940_INTCClrFlag(AFEINTSRC_DATAFIFOTHRESH);
    AppEDARegModify(pBuff, &FifoCnt);   /* If there is need to do AFE re-configure, do it here when AFE is in active state */
    //AD5940_EnterSleepS();  /* Manually put AFE back to hibernate mode. This operation only takes effect when register value is ACTIVE previously */
    AD5940_SleepKeyCtrlS(SLPKEY_UNLOCK);  /* Don't enter hibernate */
    /* Process data */ 
    AppEDADataProcess((int32_t*)pBuff,&FifoCnt); 
    *pCount = FifoCnt;
    return 0;
  }
  //NRF_LOG_DEBUG("Leave Int.\n");
  
  return 0;
} 
//static int ind=0;
#define NO_OF_EDA_MEASUREMENTS 20
  float mag, phase;
int flag=0;
int count=0;

/* print EDA result to uart */
AD5940Err EDAShowResult(void *pData, uint32_t DataCount)
{
  float RtiaMag;
  /*Process data*/
  fImpCar_Type *pImp = (fImpCar_Type*)pData;
  AppEDACtrl(EDACTRL_GETRTIAMAG, &RtiaMag);
 // NRF_LOG_INFO("Data count = %d",DataCount);
  mag=phase=0;
  /*Process data*/
  for(int i=0;i<DataCount;i++)
  {
    fImpCar_Type res;
    res = pImp[i];
    res.Real += ResistorForBaseline;    /* Show the real result of impedance under test(between F+/S+) */
    mag = AD5940_ComplexMag(&res);
    phase = AD5940_ComplexPhase(&res)*180/MATH_PI;
    //NRF_LOG_DEBUG("Rtia:%.2f,(Real,Image):(%.2f,%.2f)Ohm---Mag:%.2fOhm,Phase:%.2f\n",RtiaMag, res.Real, res.Image, mag, phase);
    flag = 1;
    count++;
  }
  return 0;
}

void AD5940_Main_EDA(void)
{

  uint32_t temp;
  fImpCar_Type EDABase = 
  {
    .Real = 24368.6,
    .Image = -16.696,
  };
  InitCfg();
  AD5940PlatformCfg();
  
  #if 0
   AGPIOCfg_Type gpio_cfg;
    gpio_cfg.FuncSet = GP6_SYNC|GP5_SYNC|GP4_SYNC|GP2_EXTCLK|GP1_SYNC|GP0_INT;
   gpio_cfg.InputEnSet = AGPIO_Pin2;
   gpio_cfg.OutputEnSet = AGPIO_Pin0|AGPIO_Pin1|AGPIO_Pin4|AGPIO_Pin5|AGPIO_Pin6;
   gpio_cfg.OutVal = 0;
   gpio_cfg.PullEnSet = 0;
   AD5940_AGPIOCfg(&gpio_cfg);
#endif 

  AD5940EDAStructInit(); /* Configure your parameters in this function */
  
  AppEDAInit(AppBuff, APPBUFF_SIZE);    /* Initialize BIA application. Provide a buffer, which is used to store sequencer commands */
  AppEDACtrl(APPCTRL_START, 0);         /* Control BIA measurment to start. Second parameter has no meaning with this command. */
  AppEDACtrl(EDACTRL_SETBASE, &EDABase);
  
  /* Step4: Configure GPIO */
  ResistorForBaseline = 19900;          /* Above result is obtained using 20kOhm resistor on BioElec Rev C board. */
  mag=phase=0;
  while(!flag)
  {
    /* Check if interrupt flag which will be set when interrupt occured. */
    if(AD5940_GetMCUIntFlag())
    {
       AD5940_ClrMCUIntFlag(); /* Clear this flag */
      temp = APPBUFF_SIZE;
      AppEDAISR(AppBuff, &temp); /* Deal with it and provide a buffer to store data we got */
      EDAShowResult(AppBuff, temp); /* Show the results to UART */
      
    }
  }
  if(flag == 1)
  {
    AD5940_LPModeClkS(LPMODECLK_HFOSC); /* Trigger switching system clock to 32kHz */
    //issue stop
    AppEDACtrl(APPCTRL_STOPSYNC, 0);  /* Stop the measurement if it's running. */
    nrf_delay_ms(2000);
    flag = 0;
    count = 0;
    AD5940_Main_EDA(); //call start again
  }
  //NRF_LOG_DEBUG("Main exit");
}


uint32_t temp;
